{"courses": [{"name": "Algorithms", "date": "2023-08-12 - Present", "skills": ["Latex"], "images": [], "description": "", "contributions": "", "links": []}, {"name": "Computational Advertising", "date": "2023-08-12 - Present", "skills": ["Python", "Network Science", "Causal Impact", "Spacy", "NLTK", "Gensim"], "images": [], "description": "", "contributions": "", "links": []}, {"name": "Data Structures", "date": "None - Present", "skills": ["C++", "Object Oriented Design", "Catch2"], "images": [], "description": "", "contributions": "", "links": []}, {"name": "Linear Algebra", "date": "None - Present", "skills": ["Python", "Sklearn", "Numpy", "Pandas", "Matplotlib"], "images": [], "description": "", "contributions": "", "links": []}, {"name": "Probability/Statistics", "date": "None - Present", "skills": ["Python", "Sklearn", "Numpy", "Pandas", "PyTorch", "Matplotlib", "Latex"], "images": [], "description": "", "contributions": "", "links": []}, {"name": "Programming Languages/Compilers", "date": "None - Present", "skills": ["OCaml", "Functional Programming"], "images": [], "description": "", "contributions": "", "links": []}, {"name": "Advertising Research Methods", "date": "None - Present", "skills": [], "images": [], "description": "", "contributions": "", "links": []}, {"name": "Software Design", "date": "None - Present", "skills": ["Object Oriented Design", "C++", "Java", "Catch2"], "images": [], "description": "", "contributions": "", "links": []}, {"name": "Systems Programming", "date": "None - Present", "skills": ["C", "Flask", "Redis", "Python", "Microservice Architecture", "AWS S3", "Docker", "REST APIs", "Multi-Threading", "Pytest", "Boto3"], "images": [], "description": "", "contributions": "", "links": []}, {"name": "Tech and Advertising Campaigns", "date": "None - Present", "skills": ["React.js", "Figma", "MUI", "Python", "Flask", "REST APIs", "Javascript", "CI/CD", "Agile", "Microservice Architecture", "Heroku"], "images": [], "description": "", "contributions": "", "links": []}], "awards": [{"name": "AP Scholar With Distinction", "date": "2020-06-01 - Present", "skills": [], "images": [], "description": "Granted to students who receive an average score of at least 3.5 on all AP Exams taken, and scores of 3 or higher on five or more of these exams.", "contributions": "", "links": []}, {"name": "Deans List", "date": "None - Present", "skills": [], "images": [], "description": "Made Deans List every semester so far by maintaining a 4.0 GPA average.", "contributions": "", "links": []}, {"type": "Presenting", "name": "Engineering Open House", "date": "2023-03-31 - 2023-04-01", "skills": [], "images": [], "description": "Presented Melodic Eyes, an interactive art exhibit, at Engineering Open House UIUC 2023.", "contributions": "", "links": []}, {"name": "Film Festivals", "date": "None - Present", "skills": [], "images": [], "description": "For several different short films I was accepted to the following film festivals: All American High school Film Festival, Middle Coast Film Festival, Catlow Film Festival, Shawnee Shorts Midwestern Film Festival, Prairie State Film Festival", "contributions": "", "links": []}, {"name": "Image of Research Semi-Finalist", "date": "2022-04-20 - Present", "skills": [], "images": [], "description": "My data visualization of misinformation networks was displayed at the Undergraduate Research Symposium in 2022.", "contributions": "", "links": []}, {"name": "James Scholar", "date": "2020-08-01 - Present", "skills": [], "images": [], "description": "Top 20% of admitted freshman class at the University of Illinois. Requires keeping a GPA of 3.5 and completing an honors project every year.", "contributions": "", "links": []}, {"type": "Filmmaking", "name": "Pens To Lens", "date": "2016-05-01 - Present", "skills": [], "images": [], "description": "Wrote a short film screenplay that was selected to be produced into a film and shown at a local movie theater. ", "contributions": "", "links": []}, {"name": "Provost Scholarship", "date": "2020-08-01 - Present", "skills": [], "images": [], "description": "Full tuition scholarship given to the top 20 incoming freshman at the University of Illinois.", "contributions": "", "links": []}, {"name": "Outstanding Poster Presentation Undergraduate Research Symposium", "date": "2022-04-20 - Present", "skills": [], "images": [], "description": "Received Outstanding Poster Presentation in Numbers, Data, and Computation at the 2022 Undergraduate Research Symposium at the University of Illinois for my work on machine learning and misinformation.", "contributions": "", "links": []}], "experience": [{"type": "Software Engineer Intern", "name": "Eli Lilly and Co", "date": "2023-05-23 - 2023-08-11", "skills": ["Javascript", "Node.js", "REST APIs", "PostgreSQL", "Agile", "Docker", "Express.js", "Open API", "PgAdmin", "Vue.js", "Vuetify", "MUI"], "images": [], "description": "", "contributions": ["Developed content management microservice from scratch, to increase scalability and speed of deployment of medical content across diverse web and mobile platforms, benefiting over 1,000 patients", "Implemented scalable REST API using Node.js with custom caching mechanism that reduced latency by 90% ", "Engineered finely-tuned PostgreSQL queries to extract, filter, and transform data for API requests", "Collaborated cross-functionally in agile workflow to deliver full stack application with thorough documentation", "Developed Docker workflow to instantiate multi-container full stack application for faster development and deployment"], "links": []}, {"type": "Undergraduate Research Assistant", "name": "Information and Intelligence Group UIUC", "date": "2022-05-01 - 2022-08-20", "skills": ["Python", "RLlib", "TensorFlow", "Altair"], "images": [], "description": "As an undergraduate research assistant at the Information and Intelligence Group, I used multi-agent reinforcement learning to experiment with different policies for improving the health of social media platforms. Specifically, I developed and tested various algorithms for modeling the interactions between users and the platform, with the goal of maximizing key metrics such as user engagement and satisfaction while minimizing negative outcomes such as spam and disinformation. Overall, this experience gave me valuable insights into the application of reinforcement learning to complex social systems, and I believe my findings could have broader implications for the design of online communities and platforms.", "contributions": ["Developed Markov decision process to model decision-making in social media environment", "Created complex multi-agent environment in Python to extend existing economic simulation framework", "Implemented PPO deep reinforcement learning algorithm using RLlib and Tensorflow to train agents to make optimal decisions in multi-agent environment", "Applied trained models to evaluate different policies and strategies for improving health and performance of social media platforms"], "links": [{"text": "Lab Website", "url": "https://publish.illinois.edu/varshney/"}]}, {"type": "Undergraduate Research Assistant", "name": "Media and Advertising Lab UIUC", "date": "2021-05-01 - 2022-08-20", "skills": ["Python", "Pandas", "Numpy", "Selenium", "BS4", "Spacy", "NLTK", "Networkx", "Altair", "Matplotlib", "Scipy", "Sklearn", "Zotero"], "images": [], "description": "As an Undergraduate Research Assistant at the Media and Advertising Lab at the University of Illinois Urbana-Champaign, I provided crucial support to a range of research projects by contributing my skills in machine learning, data processing, analysis, and visualization.  ", "contributions": ["Successfully developed and implemented Python algorithms for extracting attention metrics from high-dimensional mobile phone log data, resulting in deeper understanding of participants' behavior and potential digital biomarkers", "Conducted advanced time series sentiment analysis of movie scripts using state-of-the-art natural language processing tools (Spacy, NLTK) and machine learning techniques (Sklearn) resulting in new understanding of movie story structure", "Created key data visualizations and analyses in Python, Pandas, Altair for research paper accepted to ICA conference in Paris, France and the journal of Media Psychology", "Utilized BS4 and Selenium in developing web scrapers, resulting in significant time-saving and improved accuracy of data collection for analyses"], "links": [{"text": "Research Paper", "url": "https://doi.org/10.1080/15213269.2023.2210841"}, {"text": "MAD Lab", "url": "https://madlabresearch.web.illinois.edu/"}, {"text": "MUSE Lab", "url": "https://museresearch.github.io/"}]}], "projects": [{"type": "Data Science", "name": "Mechanisms of Misinformation", "date": "2022-01-01 - 2022-08-20", "skills": ["Python", "Altair", "Numpy", "Networkx", "TensorFlow", "PyTorch", "Sklearn", "InDesign"], "images": ["misinfo/misinfo_viz.jpeg", "misinfo/poster.jpeg", "misinfo/presenting.jpg"], "description": "The radical change social media has brought to our information ecosystem has created one of the biggest problems our world faces today: misinformation. With economic, social, and political implications, researchers have directed their attention to ways in which this problem can be understood and solved. Recent work has shown that articles from misleading sources can be told apart from mainstream sources by the topology of their Twitter diffusion networks. This project expands on these findings by attempting to answer the question: can the diffusion networks of misinformation articles reveal a set of ways in which misinformation spreads on social media? To accomplish this, the Twitter diffusion networks of over 700 articles from low credibility sources were converted to embeddings using the UGraphEmb graph embedding algorithm and clustered using k-means clustering. From here the differences in topological features of diffusion networks belonging to different clusters will be analyzed and explained. The hope is to use these results to better inform social media policy and algorithm design.", "contributions": ["Implemented cutting-edge unsupervised graph embedding algorithm in Networkx and TensorFlow to convert complex networks of misinformation diffusion to embeddings", "Utilized K-means clustering with Sklearn to identify previously unseen patterns in diffusion of misinformation, providing valuable insights for understanding and combating spread of false information", "Created poster to present findings at UIUC Undergraduate Research Symposium for which Outstanding Poster Presentation in Numbers Data And Computation was earned"], "links": [{"text": "GitHub Repo", "url": "https://github.com/ethan-grinberg/misinformation-cluster-analysis"}, {"text": "Poster", "url": "https://github.com/ethan-grinberg/misinformation-cluster-analysis/blob/master/reports/poster/ug_symposium_poster_2022.pdf"}, {"text": "Poster Presentation Award", "url": "https://blogs.illinois.edu/view/6204/678500770"}, {"text": "College Blog Post", "url": "https://media.illinois.edu/media-students-present-2022-undergraduate-research-symposium"}]}, {"type": "Web App", "name": "Melodic Eyes", "date": "2022-08-01 - 2023-04-01", "skills": ["Python", "Vue.js", "Microservice Architecture", "Javascript", "Pillow", "Flask", "REST APIs"], "images": ["melodic-eyes/demo.png", "melodic-eyes/home.png", "melodic-eyes/action.png"], "description": "Experience art and music in a whole new way! With 'Melodic Eyes', you can look at historic art pieces in a completely new light - or should we say, sound. Using an eye tracker and an image-to-music algorithm, you control the music in this modern art exhibit!", "contributions": ["Led interdisciplinary team of developers to create innovative interactive art exhibit web app presented at UIUC Engineering Open House", "Leveraged Python, Flask, and Vue.js to simulate real-time audio and visual effects for immersive user experience", "Optimized performance by decreasing backend response size, reducing bandwidth usage by 95%", "Implemented backend file system caching to significantly speed up retrieval of time-intensive computations  ", "Configured Apache cPanel server for optimized development and deployment workflow"], "links": [{"text": "Live Exhibit", "url": "https://interactiveart.web.illinois.edu/"}, {"text": "GitHub Repo", "url": "https://github.com/ethan-grinberg/interactive-art"}, {"text": "UIUC EOH Website", "url": "https://eohillinois.org/"}, {"text": "EOH 2023 Program", "url": "https://drive.google.com/file/d/1NJ4gNMKRTRc73-L5W2Bsesau-OZ5bsKc/view"}]}, {"type": "Web App", "name": "Portfolio Website", "date": "2022-12-01 - 2023-08-15", "skills": ["Vue.js", "Node.js", "Javascript", "CSS", "Vuetify", "MUI", "Python"], "images": ["portfolio/home.png", "portfolio/project.png", "portfolio/about.png"], "description": "", "contributions": ["Developed and launched a dynamic portfolio website using Vue.js, with a seamless and visually engaging user experience", "Designed and implemented an innovative content management system that parses Markdown notes to generate JSON data for website content updates without manual user interface adjustments", "Engineered a robust data pipeline that automated the process of content integration, resulting in efficient updates to project details, eliminating UI discrepancies, and enhancing content management efficiency", "Leveraged CSS transitions and animations with a custom color scheme to craft an immersive and polished user experience"], "links": [{"text": "Live Website", "url": "https://ethan-grinberg.github.io/"}, {"text": "GitHub", "url": "https://github.com/ethan-grinberg/ethan-grinberg.github.io"}]}, {"type": "Web App", "name": "Product Cupid", "date": "2022-08-01 - Present", "skills": ["Python", "Javascript", "React.js", "Flask", "Heroku", "MUI", "REST APIs", "CI/CD", "Agile", "Figma", "Microservice Architecture"], "images": ["cupid/product_cupid.png", "cupid/product_cupid2.png", "cupid/product_cupid3.png"], "description": "People love personalized recommendations but are weary of the privacy they give up to get them. This project aims to reconcile both of these seemingly opposite desires. By creating a recommendation system that only relies on volunteered user preferences, the hope is to show that it is possible to create a privacy-first recommendation system. This project is still under development, namely the AI recommendation algorithm, but so far a simple proof of concept was built. ", "contributions": ["Led development of full stack product recommendation app that used gamification techniques to enhance user experience of searching for products", "Developed Flask-based REST backend to manage product data and feed product recommendations to frontend", "Created dynamic and responsive frontend using React.js, Material UI, and Javascript for real-time data updates through HTTP requests to backend", "Created continuous integration and deployment (CI/CD) pipeline using Github and Heroku to streamline development process and ensure seamless user experience"], "links": [{"text": "GitHub Repo", "url": "https://github.com/ethan-grinberg/product-cupid"}, {"text": "Project Website", "url": "https://sites.google.com/illinois.edu/productcupid"}, {"text": "Figma Design", "url": "https://www.figma.com/proto/5Y67kWgH6rkzHOz9cBtuDQ/Final-draft?node-id=120%3A131&source=email_invite&starting-point-node-id=120%3A131"}, {"text": "Final Report", "url": "https://drive.google.com/file/d/17gkqg65eWS8lhOFFxEMIY4zjLOCbIRJw/view?usp=sharing"}]}, {"type": "Filmmaking", "name": "R.S. Documentary", "date": "2016-08-01 - 2019-08-01", "skills": [], "images": ["doc/poster.jpg", "doc/doc_pic.jpg", "doc/amazon.png"], "description": "Ray Spooner, a mild mannered, complicated man from England, leads a normal life in Urbana, Illinois. He is a nurse that delivers babies, has a wife and three kids, and rides hundreds of miles a week on his bike; often competing in competitions and raising money for charity. At the age of 55, after bringing 2,095 babies into the world, he is forced to quit upon being diagnosed with ALS. This is a disease that slowly deteriorates the body until all basic functions are taken away and death occurs. It takes Ray no time to figure out what he will do before his end date. One item on his bucket list: a 3,000 mile journey across The United States. The film proceeds to chronicle Ray's journey across America as his body deteriorates, paralleling with an intimate portrait of him, from his wife's perspective.", "contributions": ["Created a 25 minute documentary about ALS available for streaming on demand on Amazon", "Organized and advertised a charitable event screening at a local movie theater with over 100 attendees", "Some organizations that have used the film are MDA, Compassion & Choices, American Academy of Hospice and Palliative Care, Champaign County Bikes."], "links": [{"text": "Amazon Prime", "url": "https://www.amazon.com/dp/B07QY5BJKL"}, {"text": "News Article", "url": "https://www.wcia.com/news/local-news/documentary-remembering-ray-spooner/"}, {"text": "IMDB", "url": "https://www.imdb.com/title/tt7374406/?ref_=nm_knf_t_1"}]}, {"type": "NLP", "name": "Truth Trend", "date": "2021-08-01 - 2022-01-01", "skills": ["Python", "Sklearn", "Pandas", "Numpy", "Spacy"], "images": ["truth-trend/twitter.png"], "description": "", "contributions": ["Built live Python news aggregator to scrape and recommend news articles based on trending Google Searches", "Implemented novel machine learning algorithms to embed and cluster articles for topic extraction", "Scraped over 250,000 articles throughout its 9 month run time"], "links": [{"text": "GitHub Repo", "url": "https://github.com/ethan-grinberg/TruthTrend"}]}], "publications": [{"name": "The Shape of Inspiration, Exploring the Emotional Arcs and Self-Transcendent Elicitors Within Inspirational Movies", "date": "2021-11-01 - Present", "skills": [], "images": [], "description": "Katherine R. Dale, Jacob T. Fisher, Jia Liao & Ethan Grinberg (2023) The Shape of Inspiration: Exploring the Emotional Arcs and Self-Transcendent Elicitors Within Inspirational Movies, Media Psychology, DOI: 10.1080/15213269.2023.2210841", "contributions": "", "links": []}], "bio": {"name": "Ethan Grinberg", "label": "Software Engineer", "profile_pic": "profile.jpg", "email": "ethanbg2@illinois.edu", "url": "https://ethan-grinberg.github.io", "resume_url": "https://docs.google.com/document/d/1hI4xo5BDCiqm8rjPqlC2n26F9glB9UkavpYrbu4yO-s/export?format=pdf", "summary": "I'm a full stack engineer. I love bringing interesting ideas to life.", "bio": "As a software engineer, I work hard at being lazy. In other words, I'll spend hours coding so I never have to write a shopping list again. Give me a project that has the ability to make someone's life better and I won't be able to stop thinking about it until it's perfect. Vue.js, Node.js, Python, and PostgreSQL is my go-to tech stack, but I'm open to quickly adapting to any tech stack needed to bring an idea to life. Outside of automating everything, I enjoy chess, soccer, and videos of Orangutans driving golf carts.", "profiles": [{"text": "GitHub", "url": "https://github.com/ethan-grinberg"}, {"text": "LinkedIn", "url": "https://www.linkedin.com/in/ethangrinberg"}]}, "education": [{"name": "University of Illinois at Urbana-Champaign (UIUC)", "date": "2020-08-20 - 2024-05-20", "skills": [], "images": [], "description": "2020 - 2024, Bachelor of Science in Computer Science and Advertising, GPA: 4.0", "contributions": "", "links": []}]}